Tekla Open API Reference for Tekla Structures 2025
UnitAttributes Constructor
 Creates a new default UnitAttributes attributes instance. The default values are Units.Automatic, FormatTypes.Automatic.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UnitAttributes()
Public Sub New
See Also
Reference
UnitAttributes Class
UnitAttributes Overload
Tekla.Structures.Drawing Namespace